/**
 * @author qhhu
 * @date 2020/2/14 - 8:53
 *
 * [667] 优美的排列 II
 *
 * 题目: 给定两个整数n和k, 实现一个包含从1到n的n个不同整数的数组, 同时满足:
 *      1. 如果这个数组是[a1, a2, ...,an], 那么数组[|a1 - a2|, |a2 - a3|, ..., |a(n - 1) - an|]中应有且只有k个不同的整数
 *      2. 若有多种答案只需返回任意一种
 *
 * 难度: medium
 *
 * 思路: 让前 k+1 个元素构建出 k 个不相同的差值, 序列为: 1, k+1, 2, k, 3, k-1, ..., k/2, k/2+1
 *      当n = 50, k = 20时:
 *      [1,21,2,20,3,19,4,18,5,17,6,16,7,15,8,14,9,13,10,12,11,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50]
 *      当n = 50, k = 17时:
 *      [1,18,2,17,3,16,4,15,5,14,6,13,7,12,8,11,9,10,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50]
 *      当n = 80, k = 30时:
 *      [1,31,2,30,3,29,4,28,5,27,6,26,7,25,8,24,9,23,10,22,11,21,12,20,13,19,14,18,15,17,16,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80]
 *      是不是发现了规律, 就是
 *      下标从[0, k]中, 偶数下标填充[1,2,3…], 奇数下标填充[k + 1, k, k - 1…], 后面[k + 1, n - 1]都是顺序填充[k + 2, k + 3...]
 */
class Solution {
    /**
     * 时间复杂度: O(n)
     * 空间复杂度: O(1)
     */
    public int[] constructArray(int n, int k) {
        int[] ret = new int[n];
        // 让前 k+1 个元素构建出 k 个不相同的差值, 序列为: 1, k+1, 2, k, 3, k-1, ..., k/2, k/2+1
        ret[0] = 1;
        ret[1] = k + 1;
        // 下标段[0, k]中, 偶数下标填充[1,2,3..]; 下标段[0, k]中, 奇数下标填充[k + 1, k, k - 1...]
        for (int i = 2; i <= k; i++) {
            ret[i] = i % 2 == 0 ? ret[i - 2] + 1 : ret[i - 2] - 1;
        }
        //下标段[k + 1, n - 1]都是顺序填充[k + 2, k + 3...]
        for (int i = k + 1; i < n; i++) {
            ret[i] = i + 1;
        }

        return ret;
    }
}